Revit 2027 API
BeamSystem.BeamBelongsTo Method
Find out the BeamSystem to which the beam belongs.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static BeamSystem BeamBelongsTo(
	FamilyInstance beam
)
Public Shared Function BeamBelongsTo (
	beam As FamilyInstance
) As BeamSystem
public:
static BeamSystem^ BeamBelongsTo(
	FamilyInstance^ beam
)
static member BeamBelongsTo :
        beam : FamilyInstance -> BeamSystem
Parameters
beam FamilyInstance
The beam want to ask.
Return Value
BeamSystem
The BeamSystem.
See Also
Reference
BeamSystem Class
Autodesk.Revit.DB Namespace